allergen-app/app/views/ingredients/index.html.erb

    <% @ingredients.each do |item| %>
        <li><%= link_to item.name, item %> has <%= item.users.count %> people with allergies</li>
---
SELECT COUNT(*) FROM "users" INNER JOIN "allergens" ON "users"."id" = "allergens"."user_id" WHERE "allergens"."ingredient_id" = ?  [["ingredient_id", 27]]