allergen-app/app/views/ingredients/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "ingercpes" ON "recipes"."id" = "ingercpes"."recipe_id" WHERE "ingercpes"."ingredient_id" = ?  [["ingredient_id", 27]]
---
<ul>
    <% @ingredient.recipes.each do |a| %>