allergen-app/app/views/recipes/edit.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user %>
    <%= f.collection_select :user_id, User.all, :id, :name%>