allergen-app/app/views/recipes/new.html.erb

    <%= f.label :user %>
    <%= f.collection_select :user_id, User.all, :id, :name%>
---
SELECT "users".* FROM "users"