allergen-app/app/views/recipes/show.html.erb

<ul>
    <% @recipe.ingercpe.each do |x| %>
---
SELECT "ingercpes".* FROM "ingercpes" WHERE "ingercpes"."recipe_id" = ?  [["recipe_id", 4]]