allergen-app/app/controllers/allergens_controller.rb

INSERT INTO "allergens" ("user_id", "ingredient_id") VALUES (?, ?)  [["user_id", 23], ["ingredient_id", 21]]
---
    def create
        @allergen = Allergen.new(allergen_params)

        if @allergen.save