allergen-app/app/controllers/ingercpes_controller.rb

  def create
    @ingercpe = Ingercpe.new(ingercpe_params)

        if @ingercpe.valid?
            @ingercpe.save
---
INSERT INTO "ingercpes" ("measurement", "ingredient_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["measurement", "1 tablespoon"], ["ingredient_id", 32], ["recipe_id", 14], ["created_at", "2020-11-04 01:28:09.387573"], ["updated_at", "2020-11-04 01:28:09.387573"]]