allergen-app/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
SELECT COUNT(*) FROM "users" INNER JOIN "allergens" ON "users"."id" = "allergens"."user_id" WHERE "allergens"."ingredient_id" = ?  [["ingredient_id", 21]]
---
  def index
    @ingredients = Ingredient.all.sort_by{|i| i.users.count}.reverse

INSERT INTO "ingredients" ("name") VALUES (?)  [["name", "Brussel sprout"]]
---
  def create
    @ingredient = Ingredient.new(ingr_params)

        if @ingredient.valid?
            @ingredient.save

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
  def get_ingr
    @ingredient = Ingredient.find(params[:id])