allergen-app/app/controllers/recipes_controller.rb

  def index
    if params[:sort]
      @recipes = Recipe.all.sort_by{|r| r.ingredients.count}.reverse
    else
      @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "ingredients" INNER JOIN "ingercpes" ON "ingredients"."id" = "ingercpes"."ingredient_id" WHERE "ingercpes"."recipe_id" = ?  [["recipe_id", 1]]

  def destroy
    get_recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 15]]

  def get_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]