allergen-app/app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 21]]
---
  def destroy
    get_user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
  def get_user
    @user = User.find(params[:id])