allergen-app/app/views/ingercpes/new.html.erb

SELECT "recipes".* FROM "recipes"
---
    <%= f.label :recipe %>
    <%= f.collection_select :recipe_id, Recipe.all, :id, :name%>

SELECT "ingredients".* FROM "ingredients"
---
    <%= f.label :ingredient %>
    <%= f.collection_select :ingredient_id, Ingredient.all, :id, :name%>