allergen-app/app/views/allergens/new.html.erb

SELECT "users".* FROM "users"
SELECT "ingredients".* FROM "ingredients"
---
    <%= f.label :user %>
    <%= f.collection_select :user_id, User.all, :id, :name%>
    <%= f.label :user %>
    <%= f.collection_select :ingredient_id, Ingredient.all, :id, :name%>