allergen-app/app/views/users/show.html.erb

<ul>
    <% @user.allergens.each do |a| %>
---
SELECT "allergens".* FROM "allergens" WHERE "allergens"."user_id" = ?  [["user_id", 22]]

<ul>
    <% @user.recipes.each do |a| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 24]]